[
	{
		"id":"4",
		"type":"心情分享",
		"typeId":"2",
		"title":"聊一聊小说与技术",
		"user":"YS",
		"time":"2020-01-08 19:33:39",
		"jianjie":"为什么说要聊一聊我的小说与技术呢？其实是这样的，在我还在刚上高中时开始，也是第一次看的小说《绾青丝》，作者已经不记得，一篇腐女玄幻文（嗯，我对这篇小说的印象），我为什么要提到这篇小说呢，因为小说的描写总会带给自己一些代入感的幻想，从那时起突然就对小说来了兴趣，于是开始看一篇又一篇的小说，现代情感类的、玄幻类的都有去看过，每看完一部小说就像是历经了一次和主角一样的世界一样，一点一滴的感受着文字所带来的世界进行着的一点一点的变化，犹如看着一个真真正正的活的人在自己的身边慢慢的、不断的将自己锻炼的强大、无惧、无畏。也犹如自己也在跟随着这个虚幻的世界沉浮",
		"content":"<p>&nbsp; &nbsp; &nbsp; &nbsp; 为什么说要聊一聊我的小说与技术呢？其实是这样的，在我还在刚上高中时开始，也是第一次看的小说《绾青丝》，作者已经不记得，一篇腐女玄幻文（嗯，我对这篇小说的印象），我为什么要提到这篇小说呢，因为小说的描写总会带给自己一些代入感的幻想，从那时起突然就对小说来了兴趣，于是开始看一篇又一篇的小说，现代情感类的、玄幻类的都有去看过，每看完一部小说就像是历经了一次和主角一样的世界一样，一点一滴的感受着文字所带来的世界进行着的一点一点的变化，犹如看着一个真真正正的活的人在自己的身边慢慢的、不断的将自己锻炼的强大、无惧、无畏。也犹如自己也在跟随着这个虚幻的世界沉浮。小说就像一种“精神毒药”般跟随在我的身旁，如果找不到自己想去看的小说时会有些焦虑，因为不知道要去干什么好。</p><p><br/></p><p>&nbsp; &nbsp; &nbsp; &nbsp;喜爱看小说的同时也爱玩玩游戏，有一次在玩一个游戏时莫名的开始注意到一个点，那就是游戏也有和小说一样类似的世界观，于是开始觉得能将小说变成一个直观的可以看到的世界虚拟世界时，真的是好神奇，它比电视剧电影所描绘的世界观更加全面，更加生动，里面每个npc都可以找到相应的小说当中的原型，就像是将自己所幻想的世界给变为现实了一样。于是也在那时候开始对编程技术有了点想法，当然，这只是个朦胧的印象，还不知道编程是个什么东西(家乡教育落后，高中时期才有电脑课，但也只是教一些简单的word，表格和ppt)，直到出来上大学了才知道原来编程的世界也不简单，甚至是一个很艰难的过程，它不像学习语文一样开始有个abcd的音标字符来给你先进行音标的学习，然后循序渐进的、由浅入深的学习，编程的学习更笼统，它的虽然也是由浅入深的学习，但是它的浅就是直接来一段代码让你自己去理解它的含义，而且它的逻辑可能会比日常生活的逻辑会有些不同，所以初学时会感觉很晦涩难明。</p><p><br/></p><p>&nbsp; &nbsp; &nbsp; 从小说的幻想到技术编程的实现幻想，这不可谓不是一个大的改变，因为编程让抽象的幻想变为了更直观的、可以直接看到的内容，所以编程也是一个很神奇的事情，它可以让一个人在一定的规则下实现一个世界，通过这个世界，人们可以向别人展示不一样的世界观以及不同的思想。</p><p><br/></p><p>&nbsp; &nbsp; &nbsp; 技术编程在不断的更新迭代，虚拟的世界也在技术的更新下不断的完善，为我们现实世界中的人们带来另一种世界的体验，犹如小说中常常提到的穿越一般，体验不一样的世界，在一个不一样的世界成长。</p><p><br/></p>"
	},
	{
		"id":"3",
		"type":"学习历程",
		"typeId":"1",
		"title":"关于HTML",
		"user":"YS",
		"time":"2019-12-27 19:49:05",
		"jianjie":"说到HTML，我想到一个笑话，说是一个人去求职，在面试的过程中为了表示自己能力很强，他说自己会一种编程言叫html。结果是可想而知的。当然这是在同行之中以一个笑话来说的，但是，从这里面我们可以很容易的了解到，HTML并不是一种编程语言，事实上它只是一种标记语言，是用来描述网页的一种语言。",
		"content":"<p>&nbsp; &nbsp; &nbsp; &nbsp;说到HTML，我想到一个笑话，说是一个人去求职，在面试的过程中为了表示自己能力很强，他说自己会一种编程言叫html。结果是可想而知的。当然这是在同行之中以一个笑话来说的，但是，从这里面我们可以很容易的了解到，HTML并不是一种编程语言，事实上它只是一种标记语言，是用来描述网页的一种语言。</p><p><br/></p><p>&nbsp; &nbsp; &nbsp; 对于HTML其实往细了讲会涉及到很多的东西，但是实际运用中，却是大部分可能都没有去使用过，我们常用的基本上就是div、p、img、input、select、textarea、span、i、b等等标签，HTML5中也新增了很多新的知识点，例如一些新的语义化标签，一些标签扩展的新的属性，一些新的事件属性；这些都是需要慢慢去接触去学习的。如果你是一个后端开发人员，那么不必理会太多的细节性的东西，只需要会一点常用标签即可；如果是前端开发人员，那么细节的了解则是必不可少的，尤其是HTML5新增的标签及事件属性等等。</p><p><br/></p><p>&nbsp; &nbsp; &nbsp; ps：之后的日子里不会更多的去记录HTML的东西，仅此篇内容作为记录，博客中先以js、css、框架、插件、库为主上传。</p>"
	},
	{
		"id":"2",
		"type":"学习历程",
		"typeId":"1",
		"title":"关于学习历程的介绍",
		"user":"YS",
		"time":"2019-12-26 21:54:08",
		"jianjie":"关于学习历程主要是学习的一些内容，初期会将学过的一些无论简单还是困难的知识点上传上来，然后再在以后的日子里将学到的知识上传到博客，也是记录自己学习的内容，类型知识，初期分类可能没多么明确，只是统一分类，后期会给相应的文章进行更细的分类，例",
		"content":"<p>&nbsp; &nbsp; &nbsp; &nbsp;关于学习历程主要是学习的一些内容，初期会将学过的一些无论简单还是困难的知识点上传上来，然后再在以后的日子里将学到的知识上传到博客，也是记录自己学习的内容，类型知识，初期分类可能没多么明确，只是统一分类，后期会给相应的文章进行更细的分类，例如html、css、js、vue、react、jquery等等；并且因为我想要前后台的代码都是自己去完成，所以后期会去学一点php的相关知识，用于搭建后端接口之类的，同时也会上传一些自己搭建网站的需求，以上。也许所写代码并不规范，所以知识点仅供参考。</p><p><br/></p><p>&nbsp;&nbsp;&nbsp;&nbsp;ps：由于初期后端代码还没有开发，所以网站初期使用假json的方式获取数据内容</p>"
	},
	{
		"id":"1",
		"type":"关于我",
		"typeId":"0",
		"title":"关于博客",
		"user":"YS",
		"time":"2019-12-26 20:28:25",
		"jianjie":"这篇文章主要是说一下自己建立此博客网站初衷，大概在高中快毕业时，突然对程序开发有了兴趣，当时我的想法就是自己去写一个日历之类的软件，而日历的功能想法就是做一个能够记录自己日常信息，",
		"content":"<p>&nbsp; &nbsp; &nbsp; 这篇文章主要是说一下自己建立此博客网站初衷，大概在高中快毕业时，突然对程序开发有了兴趣，当时我的想法就是自己去写一个日历之类的软件，而日历的功能想法就是做一个能够记录自己日常信息，然后在高考后选择了计算机业。</p><p><br/></p><p>&nbsp; &nbsp; &nbsp; 大一时，经常与同班好友一起去空余教室去学习，但是一年下来也就会点C和html，css。大二之后，慢慢的C也不会写了，也就会点HTML和css，学过的js也几乎都不记得了开始与舍友一起随波逐流，玩游戏，玩手机，人也变得越来越懒散，越来越没有规划。我们学校在最后一年是需要自己去外面自主实习或签订学校合同的厂家去实习的，所以直到大三开学前，我开始迷茫，开始焦虑，开始觉得自己独自一人绝对无法生存在这个社会里，因为自己一点技术能力都没有，于是也就有了一些极端的、不好的想法。</p><p><br/></p><p>&nbsp; &nbsp; &nbsp;直到开学后临到出来实习前，自己莫名的想通了一些关隘，如果自己死都不怕了，那还有什么不能去搏一搏的呢，于是出来实习的找工作时便带着自己还未毕业的简历找工作，我想按照自己的想法走前端开发的路子，但是简历投出后，渐渐的全都石沉大海，这个时候我意识到自己能力与社会需求而言低了太多太多，于是决定去培训公司去培训加强自己所要进入的行业的知识(如无必要最好别进类似专门培训的公司去培训自己，自学也是一种方式，毕竟自学的方式才是陪伴你最久的方式)。</p><p><br/></p><p>&nbsp; &nbsp; &nbsp; 培训出来之后，只觉得自己会的挺多的了，然后开始面试进入了我正式工作的第一家也是目前所在的公司，进来之后才发现自己能力的严重不足，第一次去接触完整项目的开发，出现各种合作方面的不合理，各种碰壁与问题的出现让我知道合作开发的规范也是很重要的，于是开始在每天下班后去学习开发相关的知识，也越发觉得自己需要去学的越来越多，但同时也发现自己每学完一个新的知识，可能之前学习的知识却忘记的差不多了，而用于记录的笔记找起来也很麻烦，于是开始萌发做一个自己的博客网站想法，而又联想到自己刚对程序感兴趣想做的什么类型软件时，更加坚定了自己做个个人博客网站的想法。</p><p><br/></p><p>&nbsp; &nbsp; &nbsp; 个人博客网站优点：1、记录的类型区分明确。2、便于查找自己学过的有什么，当我要去回顾知识点时可以很方便的找到相应的知识点并去查看。3、也可以将自己学过的、会的知识点分享给别人，当别人偶然浏览到你的网站时，也可能看到一些自己要学的知识</p>"
	},
	{
		"id":"0",
		"type":"关于我",
		"typeId":"0",
		"title":"关于博主",
		"user":"YS",
		"time":"2019-12-26 19:33:46",
		"jianjie":"个人资料：男，90后，爱沉默的巨蟹座IT，毕业于桂林电子科技大学北海职院；<br/>爱好：刷剧，听歌，旅行，玩游戏《仙剑四》；<br/>个人简介：九零后，手机控，喜欢听各类歌曲，喜欢看玄幻类小说，喜欢在无规划下进入陌生的地点游玩",
		"content":"<p>个人资料：男，90后，爱沉默的巨蟹座IT，毕业于桂林电子科技大学北海职院；</p><p><br/></p><p>&nbsp; &nbsp; &nbsp; &nbsp;爱好：刷剧，听歌，旅行，玩游戏《仙剑四》；</p><p><br/></p><p>&nbsp; &nbsp; &nbsp; &nbsp;个人简介：九零后，手机控，喜欢听各类歌曲，喜欢看玄幻类小说，喜欢在无规划下进入陌生的地点游玩，喜欢一个人躲在黑暗里刷刷手机看看电视，喜欢沉浸在自己的世界里，渴望去接触更多未知的事物，&quot;梦想&quot;在30岁前徒步游全国(家庭情况限制，不知是否可以实现)经常去csdn中看一看别人的文章或知识点</p><p><br/></p><p>联系方式</p><p><br/></p><p>&nbsp; &nbsp; &nbsp; &nbsp;邮箱：1257712175@qq.com</p><p><br/></p><p>&nbsp; &nbsp; &nbsp; &nbsp;微信：夜殇</p><p><br/></p><p>&nbsp; &nbsp; &nbsp; &nbsp;qq：1257712175</p>"
	}
]